docs/benchmarks/k6-smoke-tier-1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 40s max duration (incl. graceful stop):
              * default: 5 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  01.0s/10s

running (02.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  02.0s/10s

running (03.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  03.0s/10s

running (04.0s), 5/5 VUs, 170 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  04.0s/10s

running (05.0s), 5/5 VUs, 210 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  05.0s/10s

running (06.0s), 5/5 VUs, 255 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  06.0s/10s

running (07.0s), 5/5 VUs, 295 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  07.0s/10s

running (08.0s), 5/5 VUs, 340 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  08.0s/10s

running (09.0s), 5/5 VUs, 380 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  09.0s/10s

running (10.0s), 5/5 VUs, 425 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  10.0s/10s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=3.61ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4300    428.444725/s
    checks_succeeded...: 100.00% 4300 out of 4300
    checks_failed......: 0.00%   0 out of 4300

    ✓ criar entrega: 201
    ✓ marcar pronta: 204
    ✓ oferecer: 204
    ✓ cadastrar entregador: 201
    ✓ disponibilizar entregador: 204
    ✓ atribuir: 204
    ✓ coletar: 204
    ✓ concluir: 204
    ✓ consultar: 200
    ✓ estado final: delivered

    HTTP
    http_req_duration..............: avg=1.73ms   min=220.2µs  med=1.42ms   max=21.88ms  p(90)=2.39ms   p(95)=3.61ms  
      { expected_response:true }...: avg=1.73ms   min=220.2µs  med=1.42ms   max=21.88ms  p(90)=2.39ms   p(95)=3.61ms  
    http_req_failed................: 0.00%  0 out of 3870
    http_reqs......................: 3870   385.600253/s

    EXECUTION
    iteration_duration.............: avg=116.68ms min=111.66ms med=114.54ms max=151.01ms p(90)=127.31ms p(95)=130.36ms
    iterations.....................: 430    42.844473/s
    vus............................: 5      min=5         max=5
    vus_max........................: 5      min=5         max=5

    NETWORK
    data_received..................: 633 kB 63 kB/s
    data_sent......................: 649 kB 65 kB/s



running (10.0s), 0/5 VUs, 430 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  10s